posts/reading/lean-python/index.org
#+BEGIN_COMMENT
.. title: Lean Python
.. slug: lean-python
.. date: 2017-07-15
.. tags: python
.. category: Books
.. link:
.. description:
.. type: text
#+END_COMMENT

* Getting Started
- Variables
  - The first character must be a letter or underscore.
    - Don't start a variable with a underscore, which is usually used
      for special identifiers.
  - Additional characters may be alphanumeric or underscore.
  - Names are case sensitive.
- Assignment
  #+BEGIN_SRC python
    text = 'Some Text'
    Name = 'Mr' + ' ' + 'Fred'
    # list.
    shoppingList = ['ham', 'eggs', 'mushrooms']
    # multiple assignment.
    a, b, c = 1, 2, 3
    p, q, r = myFunc() # when myFunc() returns three values
  #+END_SRC
- Special identifiers, the name will be of the form: \
  =_xxx=, =__xxx__=, =__xxx=
- =__name__= special variable specified how the module is called, it
  will be:
  - The name of the module if imported,
  - The string =__main__= if executed directly.
  - The following code let the interpreter loads your program and runs
    it if necessary
  #+BEGIN_SRC python
    if __name__ == '__main__' :
        main()
  #+END_SRC

