posts/reading/lean-python/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Lean Python | Warren Liu</title>
<link href="../../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../rss.xml">
<link rel="canonical" href="https://example.com/posts/reading/lean-python/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../patterns-enterprise-application-architecture/" title="Patterns of Enterprise Application Architecture" type="text/html">
<link rel="next" href="../gradle-in-action/" title="Gradle In Action" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="Lean Python">
<meta property="og:url" content="https://example.com/posts/reading/lean-python/">
<meta property="og:description" content="Getting Started


Variables

The first character must be a letter or underscore.

Don't start a variable with a underscore, which is usually used
for special identifiers.



Additional characters may ">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-15T00:00:00+01:00">
<meta property="article:tag" content="python">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">Warren Liu</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../../archive.html">Archive</a>
                </li>
<li>
<a href="../../../categories/">Tags</a>
                </li>
<li>
<a href="../../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Lean Python</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Warren Liu
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2017-07-15T00:00:00+01:00" itemprop="datePublished" title="2017-07-15 00:00">2017-07-15 00:00</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Getting Started</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Variables
<ul class="org-ul">
<li>The first character must be a letter or underscore.
<ul class="org-ul">
<li>Don't start a variable with a underscore, which is usually used
for special identifiers.
</li>
</ul>
</li>
<li>Additional characters may be alphanumeric or underscore.
</li>
<li>Names are case sensitive.
</li>
</ul>
</li>
<li>Assignment
<div class="highlight"><pre><span></span><span class="n">text</span> <span class="o">=</span> <span class="s1">'Some Text'</span>
<span class="n">Name</span> <span class="o">=</span> <span class="s1">'Mr'</span> <span class="o">+</span> <span class="s1">' '</span> <span class="o">+</span> <span class="s1">'Fred'</span>
<span class="c1"># list.</span>
<span class="n">shoppingList</span> <span class="o">=</span> <span class="p">[</span><span class="s1">'ham'</span><span class="p">,</span> <span class="s1">'eggs'</span><span class="p">,</span> <span class="s1">'mushrooms'</span><span class="p">]</span>
<span class="c1"># multiple assignment.</span>
<span class="n">a</span><span class="p">,</span> <span class="n">b</span><span class="p">,</span> <span class="n">c</span> <span class="o">=</span> <span class="mi">1</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span> <span class="mi">3</span>
<span class="n">p</span><span class="p">,</span> <span class="n">q</span><span class="p">,</span> <span class="n">r</span> <span class="o">=</span> <span class="n">myFunc</span><span class="p">()</span> <span class="c1"># when myFunc() returns three values</span>
</pre></div>
</li>
<li>Special identifiers, the name will be of the form: \
<code>_xxx</code>, <code>__xxx__</code>, <code>__xxx</code>
</li>
<li>
<code>__name__</code> special variable specified how the module is called, it
will be:
<ul class="org-ul">
<li>The name of the module if imported,
</li>
<li>The string <code>__main__</code> if executed directly.
</li>
<li>The following code let the interpreter loads your program and runs
it if necessary
</li>
</ul>
<div class="highlight"><pre><span></span><span class="k">if</span> <span class="vm">__name__</span> <span class="o">==</span> <span class="s1">'__main__'</span> <span class="p">:</span>
    <span class="n">main</span><span class="p">()</span>
</pre></div>
</li>
</ul>
</div>
</div>
