posts/reading/lean-python/index.org
* Python Objects
  :LOGBOOK:
  CLOCK: [2017-07-03 Mon 22:10]--[2017-07-03 Mon 22:55] =>  0:45
  :END:
- All variables have a type which can be seen using the build-in
  =type()= function.
  #+BEGIN_SRC python
  type(23)  # <type 'int'>
  type('some more text')  # <type 'str'>
  type([1,2,'some'])  # <type list'>
  #+END_SRC
- Other types are =class=, =module=, =function=, =file=, =bool=,
  =NoneType= and =long=
- The special constants =True= and =False= are =bool= type, special
  constant =None= is a =NoneType=
- Function =str()= is used to see a textual definition of any object
- Factory functions are a serials of functions that create variable
  types directly
  - =int(4.0)= create integer =4=
  - =str(4)= create string ='4'=
  - =list(1,2,3,4,5)= create =list [1,2,3,4,5]=
  - =tuple(1,2,3,4)= create tuple =(1,2,3,4)=
  - ~dict(one=1,two=2)~ create dictionary ={'one': 1, 'two': 2}=
- Exponentiation operator: =4 ** 3=
- Boolean are actually held as integers but have a value of either
  =True= or =False=
  - =bool(23)=  : =True=, all nonzero integers
  - =bool(0)=  : =False=
  - =bool('any')= : =True=, any string
  - =bool('')= : =False=, zero length string
  - =bool([])= : =False=, empty lists
- Sequences: Strings, Lists, and Tuples.
- Tuples value much like a list, but the entries in a tuple are *immutable*
- Membership test in sequence:
  #+BEGIN_SRC python
    'a' in 'track'    # True
    9 in [1,2,3,4,5]  # False
    'x' not in 'next'  # False
    'red' not in ['tan', 'pink']  # True
  #+END_SRC
- Two or more sequences can be added together using =+=
- Or Using string's =join()= method to join a list of strings, or tuple
  #+BEGIN_SRC python
  '-'.join(('a', 'b', 'c'))  # 'a-b-c'
  #+END_SRC
- A slice is a convenient way to select a subset of elements in sequence
  - =[startIndex:endIndex]= : not including =endIndex=
  - index of minus value : counting from end. =-1= index refer to the
    last element of the sequence.
  - either =startIndex= or =endIndex= can be omitted.
- Built-in Sequence Functions: =len()=, =max()=, =min()=， =sum()=,
  =sorted()=, =reversed()=
- String can be delimt with either single (') or double (")
  quotes. You can embed either quote inside the other.
- Access substring with slices.
- Strings can be compared with =>=, =<=, ~==~.
- String can be searched using the membership test of sequence.
- Longer pieces of text with embedded new lines can be assigned using
  the triple quotes.
- String formatting can be done using the =%= operator
  #+BEGIN_SRC python
    ntoys  = 4
    myname = 'Fred'
    '%s has %d toys' % (myname, ntoys)
  #+END_SRC
  - =%c= Single character/string of length 1
  - =%s= String
  - =%d= Signed decimal integer
  - =%f= Floating point number
  - =%%= Percent character
- Updating Lists with =append()= and =del= statement
  #+BEGIN_SRC python
    myList = []
    myList.append('Tom')
    myList.append('Dick')
    myList[1]='Bill'
    del myList[1]
  #+END_SRC
- Using =index()= method to find an entry and returns the offset of
  that entry.
  - If the entry cannot be found, it returns an Error.
- Dictionary
  #+BEGIN_SRC python
    wdays={'M': 'Monday', 'T': 'Tuesday'}
    wdays['M']=='Monday'
    wdays['W']='Wednesday'
    del wdays['W']
    len(wdays)
  #+END_SRC

* Program Structure
- =pass= statment is a /do nothing/ statement, is often useful to show
  explicitly that the program is doing nothing.
- List comprehensions is a way of dynamically creating a list of
  elements in an elegant shorthand.
  #+BEGIN_SRC python
    squares = []
    for i in range(1,11):
        squares.append(i*i)
    squares = [i*i for i in range(1,11)]
    evens = [i for i in range(1,100) if not i % 2]
  #+END_SRC
  - The syntax is =[expr for element in iterable if condition]=
- A python function can return more than one result: \\
  =return r1, r2, r3=.
- and it can be assigned to multiple value at same time: \\
  =max, min, average = analyse(numlist)=
- Named arguments and default value:
  #+BEGIN_SRC python
    def fn(a,b,c=1.0):
        return a*b*c
    fn(1,2,3)
    fn(1,2)
    fn(1, b=2)
  #+END_SRC
- Variables defined in module are visible to the functions in the
  module

