posts/reading/lean-python/index.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Python Objects</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>All variables have a type which can be seen using the build-in
<code>type()</code> function.
<div class="highlight"><pre><span></span><span class="nb">type</span><span class="p">(</span><span class="mi">23</span><span class="p">)</span>  <span class="c1"># &lt;type 'int'&gt;</span>
<span class="nb">type</span><span class="p">(</span><span class="s1">'some more text'</span><span class="p">)</span>  <span class="c1"># &lt;type 'str'&gt;</span>
<span class="nb">type</span><span class="p">([</span><span class="mi">1</span><span class="p">,</span><span class="mi">2</span><span class="p">,</span><span class="s1">'some'</span><span class="p">])</span>  <span class="c1"># &lt;type list'&gt;</span>
</pre></div>
</li>
<li>Other types are <code>class</code>, <code>module</code>, <code>function</code>, <code>file</code>, <code>bool</code>,
<code>NoneType</code> and <code>long</code>
</li>
<li>The special constants <code>True</code> and <code>False</code> are <code>bool</code> type, special
constant <code>None</code> is a <code>NoneType</code>
</li>
<li>Function <code>str()</code> is used to see a textual definition of any object
</li>
<li>Factory functions are a serials of functions that create variable
types directly
<ul class="org-ul">
<li>
<code>int(4.0)</code> create integer <code>4</code>
</li>
<li>
<code>str(4)</code> create string ='4'=
</li>
<li>
<code>list(1,2,3,4,5)</code> create <code>list [1,2,3,4,5]</code>
</li>
<li>
<code>tuple(1,2,3,4)</code> create tuple <code>(1,2,3,4)</code>
</li>
<li>
<code>dict(one=1,two=2)</code> create dictionary <code>{'one': 1, 'two': 2}</code>
</li>
</ul>
</li>
<li>Exponentiation operator: <code>4 ** 3</code>
</li>
<li>Boolean are actually held as integers but have a value of either
<code>True</code> or <code>False</code>
<ul class="org-ul">
<li>
<code>bool(23)</code>  : <code>True</code>, all nonzero integers
</li>
<li>
<code>bool(0)</code>  : <code>False</code>
</li>
<li>
<code>bool('any')</code> : <code>True</code>, any string
</li>
<li>
<code>bool('')</code> : <code>False</code>, zero length string
</li>
<li>
<code>bool([])</code> : <code>False</code>, empty lists
</li>
</ul>
</li>
<li>Sequences: Strings, Lists, and Tuples.
</li>
<li>Tuples value much like a list, but the entries in a tuple are <b>immutable</b>
</li>
<li>Membership test in sequence:
<div class="highlight"><pre><span></span><span class="s1">'a'</span> <span class="ow">in</span> <span class="s1">'track'</span>    <span class="c1"># True</span>
<span class="mi">9</span> <span class="ow">in</span> <span class="p">[</span><span class="mi">1</span><span class="p">,</span><span class="mi">2</span><span class="p">,</span><span class="mi">3</span><span class="p">,</span><span class="mi">4</span><span class="p">,</span><span class="mi">5</span><span class="p">]</span>  <span class="c1"># False</span>
<span class="s1">'x'</span> <span class="ow">not</span> <span class="ow">in</span> <span class="s1">'next'</span>  <span class="c1"># False</span>
<span class="s1">'red'</span> <span class="ow">not</span> <span class="ow">in</span> <span class="p">[</span><span class="s1">'tan'</span><span class="p">,</span> <span class="s1">'pink'</span><span class="p">]</span>  <span class="c1"># True</span>
</pre></div>
</li>
<li>Two or more sequences can be added together using <code>+</code>
</li>
<li>Or Using string's <code>join()</code> method to join a list of strings, or tuple
<div class="highlight"><pre><span></span><span class="s1">'-'</span><span class="o">.</span><span class="n">join</span><span class="p">((</span><span class="s1">'a'</span><span class="p">,</span> <span class="s1">'b'</span><span class="p">,</span> <span class="s1">'c'</span><span class="p">))</span>  <span class="c1"># 'a-b-c'</span>
</pre></div>
</li>
<li>A slice is a convenient way to select a subset of elements in sequence
<ul class="org-ul">
<li>
<code>[startIndex:endIndex]</code> : not including <code>endIndex</code>
</li>
<li>index of minus value : counting from end. <code>-1</code> index refer to the
last element of the sequence.
</li>
<li>either <code>startIndex</code> or <code>endIndex</code> can be omitted.
</li>
</ul>
</li>
<li>Built-in Sequence Functions: <code>len()</code>, <code>max()</code>, <code>min()=， =sum()</code>,
<code>sorted()</code>, <code>reversed()</code>
</li>
<li>String can be delimt with either single (') or double (")
quotes. You can embed either quote inside the other.
</li>
<li>Access substring with slices.
</li>
<li>Strings can be compared with <code>&gt;</code>, <code>&lt;</code>, <code>==</code>.
</li>
<li>String can be searched using the membership test of sequence.
</li>
<li>Longer pieces of text with embedded new lines can be assigned using
the triple quotes.
</li>
<li>String formatting can be done using the <code>%</code> operator
<div class="highlight"><pre><span></span><span class="n">ntoys</span>  <span class="o">=</span> <span class="mi">4</span>
<span class="n">myname</span> <span class="o">=</span> <span class="s1">'Fred'</span>
<span class="s1">'</span><span class="si">%s</span><span class="s1"> has </span><span class="si">%d</span><span class="s1"> toys'</span> <span class="o">%</span> <span class="p">(</span><span class="n">myname</span><span class="p">,</span> <span class="n">ntoys</span><span class="p">)</span>
</pre></div>
<ul class="org-ul">
<li>
<code>%c</code> Single character/string of length 1
</li>
<li>
<code>%s</code> String
</li>
<li>
<code>%d</code> Signed decimal integer
</li>
<li>
<code>%f</code> Floating point number
</li>
<li>
<code>%%</code> Percent character
</li>
</ul>
</li>
<li>Updating Lists with <code>append()</code> and <code>del</code> statement
<div class="highlight"><pre><span></span><span class="n">myList</span> <span class="o">=</span> <span class="p">[]</span>
<span class="n">myList</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="s1">'Tom'</span><span class="p">)</span>
<span class="n">myList</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="s1">'Dick'</span><span class="p">)</span>
<span class="n">myList</span><span class="p">[</span><span class="mi">1</span><span class="p">]</span><span class="o">=</span><span class="s1">'Bill'</span>
<span class="k">del</span> <span class="n">myList</span><span class="p">[</span><span class="mi">1</span><span class="p">]</span>
</pre></div>
</li>
<li>Using <code>index()</code> method to find an entry and returns the offset of
that entry.
<ul class="org-ul">
<li>If the entry cannot be found, it returns an Error.
</li>
</ul>
</li>
<li>Dictionary
<div class="highlight"><pre><span></span><span class="n">wdays</span><span class="o">=</span><span class="p">{</span><span class="s1">'M'</span><span class="p">:</span> <span class="s1">'Monday'</span><span class="p">,</span> <span class="s1">'T'</span><span class="p">:</span> <span class="s1">'Tuesday'</span><span class="p">}</span>
<span class="n">wdays</span><span class="p">[</span><span class="s1">'M'</span><span class="p">]</span><span class="o">==</span><span class="s1">'Monday'</span>
<span class="n">wdays</span><span class="p">[</span><span class="s1">'W'</span><span class="p">]</span><span class="o">=</span><span class="s1">'Wednesday'</span>
<span class="k">del</span> <span class="n">wdays</span><span class="p">[</span><span class="s1">'W'</span><span class="p">]</span>
<span class="nb">len</span><span class="p">(</span><span class="n">wdays</span><span class="p">)</span>
</pre></div>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Program Structure</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>
<code>pass</code> statment is a <i>do nothing</i> statement, is often useful to show
explicitly that the program is doing nothing.
</li>
<li>List comprehensions is a way of dynamically creating a list of
elements in an elegant shorthand.
<div class="highlight"><pre><span></span><span class="n">squares</span> <span class="o">=</span> <span class="p">[]</span>
<span class="k">for</span> <span class="n">i</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="mi">1</span><span class="p">,</span><span class="mi">11</span><span class="p">):</span>
    <span class="n">squares</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="n">i</span><span class="o">*</span><span class="n">i</span><span class="p">)</span>
<span class="n">squares</span> <span class="o">=</span> <span class="p">[</span><span class="n">i</span><span class="o">*</span><span class="n">i</span> <span class="k">for</span> <span class="n">i</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="mi">1</span><span class="p">,</span><span class="mi">11</span><span class="p">)]</span>
<span class="n">evens</span> <span class="o">=</span> <span class="p">[</span><span class="n">i</span> <span class="k">for</span> <span class="n">i</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="mi">1</span><span class="p">,</span><span class="mi">100</span><span class="p">)</span> <span class="k">if</span> <span class="ow">not</span> <span class="n">i</span> <span class="o">%</span> <span class="mi">2</span><span class="p">]</span>
</pre></div>
<ul class="org-ul">
<li>The syntax is <code>[expr for element in iterable if condition]</code>
</li>
</ul>
</li>
<li>A python function can return more than one result: <br><code>return r1, r2, r3</code>.
</li>
<li>and it can be assigned to multiple value at same time: <br><code>max, min, average = analyse(numlist)</code>
</li>
<li>Named arguments and default value:
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="nf">fn</span><span class="p">(</span><span class="n">a</span><span class="p">,</span><span class="n">b</span><span class="p">,</span><span class="n">c</span><span class="o">=</span><span class="mf">1.0</span><span class="p">):</span>
    <span class="k">return</span> <span class="n">a</span><span class="o">*</span><span class="n">b</span><span class="o">*</span><span class="n">c</span>
<span class="n">fn</span><span class="p">(</span><span class="mi">1</span><span class="p">,</span><span class="mi">2</span><span class="p">,</span><span class="mi">3</span><span class="p">)</span>
<span class="n">fn</span><span class="p">(</span><span class="mi">1</span><span class="p">,</span><span class="mi">2</span><span class="p">)</span>
<span class="n">fn</span><span class="p">(</span><span class="mi">1</span><span class="p">,</span> <span class="n">b</span><span class="o">=</span><span class="mi">2</span><span class="p">)</span>
</pre></div>
</li>
<li>Variables defined in module are visible to the functions in the
module
</li>
</ul>
</div>
</div>
