posts/reading/lean-python/index.org
* Input and Output
- Stdin/Stdout
  - =print()= function takes format of:
    #+BEGIN_SRC python
    print(arg1, arg2, arg3..., sep=' ', end='\n')
    #+END_SRC
  - Note that in python 2, =print= is a statement, not a function.
  - The trailing newline can be suppressed by setting the end argument
    to an empty string.
  - It is common to use the string formatting feature:
    #+BEGIN_SRC python
    print('%d plus %d makes %d' % (3,7,10))
    #+END_SRC
  - Use =input()= function to get data into the program:
    #+BEGIN_SRC python
      youName = input('Enter your name: ')
      print('You name is', yourName)
    #+END_SRC
  - If you ask the user for an integer number, you should check the
    text:
    - Use =len(text)= to verify text has been entered.
    - Use =text.isdigit()= to check the text is a number.
    - Use =int(text)= to convert the text to an integer.
- Files
  - Opening file with: =fileobj = open(filename, mode)=
  - Closing file with: =fileobj.close()=
  - Reading file:
    - =read()= : read the entire contents of the file into a string
      - The content can then be split into lines using =split('\n')=
    - Or using =readlines()=, which returns a list containing each
      line.
    - A good way of cleaning up the newline at the end:
      #+BEGIN_SRC python
        lines = [line.rstrip() for line in fp.readlines()]
      #+END_SRC
    - the file object itself is an iterator which can be used:
      #+BEGIN_SRC python
        fp = open(fname, 'r')
        for eachLine in fp:
            # process each line
            print(eachLine, end='')
        fp.close()
      #+END_SRC
  - Writing a file:
    - using =write()=
    - using =writelines()=
    - both methods do not append trailing newline (='\n'=)
  - Accessing File System using the =os= module, which must be imported.
- Command-Ling arguments can be obtained from =sys= module's
  =sys.argv=. The first argument (element 0) is the name of the
  program itself.

* Using Modules
- The =import= statement has format:  \\
  =import modulename [as name]= \\
  =from module import name1, name2= \\
  =from module import *= \\
- Modules come from the python path (=sys.path=), which is a list of
  directories that is set up by the Python installation process.

* Object Orientation
  :LOGBOOK:
  CLOCK: [2017-07-05 Wed 16:01]--[2017-07-05 Wed 16:06] =>  0:05
  :END:
- Python doesn't need a =new= method: when the object is created,
  Python looks for an =__init__()= method to initialize the object.
- The arguments passed through the =__init__()= call are used to
  initialize the object attributes.
- The first argument to all the methods in the class is =self=, the
  object itself. This argument is used internally in the class and
  is not exposed to the code that calls these method.
- The =self.= attributes are public.
* Exception and Error Handling
  :LOGBOOK:
  CLOCK: [2017-07-05 Wed 16:06]--[2017-07-05 Wed 16:12] =>  0:06
  :END:
  - =try/except= to catch exception
    #+BEGIN_SRC python
      print("input two numbers, the first will be devided by the second")

      afirst = input('1st number: ')
      asecond = input('2nd number: ')

      try:
          first=float(afirst)
          second=float(asecond)
          quotient = first / second
          print('Quotient 1st/2nd = %f' % quotient )
      except Exception as diag:
          print(diag.__class__.__name__, ':', diag)
    #+END_SRC
  - It is possible to trap multiple exception types by: \\
    =except (ValueError, ZeroDivisionError) [as e]:=
* Databases
    :LOGBOOK:
    CLOCK: [2017-07-05 Wed 16:14]
    :END:
- SQLLite can be used for development or prototyping.
- Database Functions
  #+BEGIN_SRC python
    # Open (or create) a database file
    conn  = sqlite3.connect(filename)
    # executes a SQL statement
    conn.executescript(sql)
    # return a cursor
    cursor = conn.cursor()
    # execute the SQL query that returns rows of data
    cursor.execute(sql)
    # return the data as list of rows
    rows = cursor.fetchall()
  #+END_SRC
