posts/reading/lean-python/index.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Input and Output</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Stdin/Stdout
<ul class="org-ul">
<li>
<code>print()</code> function takes format of:
<div class="highlight"><pre><span></span><span class="k">print</span><span class="p">(</span><span class="n">arg1</span><span class="p">,</span> <span class="n">arg2</span><span class="p">,</span> <span class="n">arg3</span><span class="o">...</span><span class="p">,</span> <span class="n">sep</span><span class="o">=</span><span class="s1">' '</span><span class="p">,</span> <span class="n">end</span><span class="o">=</span><span class="s1">'</span><span class="se">\n</span><span class="s1">'</span><span class="p">)</span>
</pre></div>
</li>
<li>Note that in python 2, <code>print</code> is a statement, not a function.
</li>
<li>The trailing newline can be suppressed by setting the end argument
to an empty string.
</li>
<li>It is common to use the string formatting feature:
<div class="highlight"><pre><span></span><span class="k">print</span><span class="p">(</span><span class="s1">'</span><span class="si">%d</span><span class="s1"> plus </span><span class="si">%d</span><span class="s1"> makes </span><span class="si">%d</span><span class="s1">'</span> <span class="o">%</span> <span class="p">(</span><span class="mi">3</span><span class="p">,</span><span class="mi">7</span><span class="p">,</span><span class="mi">10</span><span class="p">))</span>
</pre></div>
</li>
<li>Use <code>input()</code> function to get data into the program:
<div class="highlight"><pre><span></span><span class="n">youName</span> <span class="o">=</span> <span class="nb">input</span><span class="p">(</span><span class="s1">'Enter your name: '</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="s1">'You name is'</span><span class="p">,</span> <span class="n">yourName</span><span class="p">)</span>
</pre></div>
</li>
<li>If you ask the user for an integer number, you should check the
text:
<ul class="org-ul">
<li>Use <code>len(text)</code> to verify text has been entered.
</li>
<li>Use <code>text.isdigit()</code> to check the text is a number.
</li>
<li>Use <code>int(text)</code> to convert the text to an integer.
</li>
</ul>
</li>
</ul>
</li>
<li>Files
<ul class="org-ul">
<li>Opening file with: <code>fileobj = open(filename, mode)</code>
</li>
<li>Closing file with: <code>fileobj.close()</code>
</li>
<li>Reading file:
<ul class="org-ul">
<li>
<code>read()</code> : read the entire contents of the file into a string
<ul class="org-ul">
<li>The content can then be split into lines using <code>split('\n')</code>
</li>
</ul>
</li>
<li>Or using <code>readlines()</code>, which returns a list containing each
line.
</li>
<li>A good way of cleaning up the newline at the end:
<div class="highlight"><pre><span></span><span class="n">lines</span> <span class="o">=</span> <span class="p">[</span><span class="n">line</span><span class="o">.</span><span class="n">rstrip</span><span class="p">()</span> <span class="k">for</span> <span class="n">line</span> <span class="ow">in</span> <span class="n">fp</span><span class="o">.</span><span class="n">readlines</span><span class="p">()]</span>
</pre></div>
</li>
<li>the file object itself is an iterator which can be used:
<div class="highlight"><pre><span></span><span class="n">fp</span> <span class="o">=</span> <span class="nb">open</span><span class="p">(</span><span class="n">fname</span><span class="p">,</span> <span class="s1">'r'</span><span class="p">)</span>
<span class="k">for</span> <span class="n">eachLine</span> <span class="ow">in</span> <span class="n">fp</span><span class="p">:</span>
    <span class="c1"># process each line</span>
    <span class="k">print</span><span class="p">(</span><span class="n">eachLine</span><span class="p">,</span> <span class="n">end</span><span class="o">=</span><span class="s1">''</span><span class="p">)</span>
<span class="n">fp</span><span class="o">.</span><span class="n">close</span><span class="p">()</span>
</pre></div>
</li>
</ul>
</li>
<li>Writing a file:
<ul class="org-ul">
<li>using <code>write()</code>
</li>
<li>using <code>writelines()</code>
</li>
<li>both methods do not append trailing newline (='\n'=)
</li>
</ul>
</li>
<li>Accessing File System using the <code>os</code> module, which must be imported.
</li>
</ul>
</li>
<li>Command-Ling arguments can be obtained from <code>sys</code> module's
<code>sys.argv</code>. The first argument (element 0) is the name of the
program itself.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Using Modules</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>The <code>import</code> statement has format:  <br><code>import modulename [as name]</code> <br><code>from module import name1, name2</code> <br><code>from module import *</code> <br>
</li>
<li>Modules come from the python path (<code>sys.path</code>), which is a list of
directories that is set up by the Python installation process.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Object Orientation</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Python doesn't need a <code>new</code> method: when the object is created,
Python looks for an <code>__init__()</code> method to initialize the object.
</li>
<li>The arguments passed through the <code>__init__()</code> call are used to
initialize the object attributes.
</li>
<li>The first argument to all the methods in the class is <code>self</code>, the
object itself. This argument is used internally in the class and
is not exposed to the code that calls these method.
</li>
<li>The <code>self.</code> attributes are public.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Exception and Error Handling</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>
<code>try/except</code> to catch exception
<div class="highlight"><pre><span></span><span class="k">print</span><span class="p">(</span><span class="s2">"input two numbers, the first will be devided by the second"</span><span class="p">)</span>

<span class="n">afirst</span> <span class="o">=</span> <span class="nb">input</span><span class="p">(</span><span class="s1">'1st number: '</span><span class="p">)</span>
<span class="n">asecond</span> <span class="o">=</span> <span class="nb">input</span><span class="p">(</span><span class="s1">'2nd number: '</span><span class="p">)</span>

<span class="k">try</span><span class="p">:</span>
    <span class="n">first</span><span class="o">=</span><span class="nb">float</span><span class="p">(</span><span class="n">afirst</span><span class="p">)</span>
    <span class="n">second</span><span class="o">=</span><span class="nb">float</span><span class="p">(</span><span class="n">asecond</span><span class="p">)</span>
    <span class="n">quotient</span> <span class="o">=</span> <span class="n">first</span> <span class="o">/</span> <span class="n">second</span>
    <span class="k">print</span><span class="p">(</span><span class="s1">'Quotient 1st/2nd = </span><span class="si">%f</span><span class="s1">'</span> <span class="o">%</span> <span class="n">quotient</span> <span class="p">)</span>
<span class="k">except</span> <span class="ne">Exception</span> <span class="k">as</span> <span class="n">diag</span><span class="p">:</span>
    <span class="k">print</span><span class="p">(</span><span class="n">diag</span><span class="o">.</span><span class="vm">__class__</span><span class="o">.</span><span class="vm">__name__</span><span class="p">,</span> <span class="s1">':'</span><span class="p">,</span> <span class="n">diag</span><span class="p">)</span>
</pre></div>
</li>
<li>It is possible to trap multiple exception types by: <br><code>except (ValueError, ZeroDivisionError) [as e]:</code>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Databases</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>SQLLite can be used for development or prototyping.
</li>
<li>Database Functions
<div class="highlight"><pre><span></span><span class="c1"># Open (or create) a database file</span>
<span class="n">conn</span>  <span class="o">=</span> <span class="n">sqlite3</span><span class="o">.</span><span class="n">connect</span><span class="p">(</span><span class="n">filename</span><span class="p">)</span>
<span class="c1"># executes a SQL statement</span>
<span class="n">conn</span><span class="o">.</span><span class="n">executescript</span><span class="p">(</span><span class="n">sql</span><span class="p">)</span>
<span class="c1"># return a cursor</span>
<span class="n">cursor</span> <span class="o">=</span> <span class="n">conn</span><span class="o">.</span><span class="n">cursor</span><span class="p">()</span>
<span class="c1"># execute the SQL query that returns rows of data</span>
<span class="n">cursor</span><span class="o">.</span><span class="n">execute</span><span class="p">(</span><span class="n">sql</span><span class="p">)</span>
<span class="c1"># return the data as list of rows</span>
<span class="n">rows</span> <span class="o">=</span> <span class="n">cursor</span><span class="o">.</span><span class="n">fetchall</span><span class="p">()</span>
</pre></div>
</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/python/" rel="tag">python</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../patterns-enterprise-application-architecture/" rel="prev" title="Patterns of Enterprise Application Architecture">Previous post</a>
            </li>
            <li class="next">
                <a href="../gradle-in-action/" rel="next" title="Gradle In Action">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:n.tesla@example.com">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
